# アプリ系のインストール先の指定
cask_args appdir: "/Applications"

# デスクトップアプリケーションの管理
cask "google-chrome"
cask "warp"
cask "slack"
cask "docker"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "github"
cask "deepl"

# CLIツールの管理
brew "asdf"
brew "mas"
brew "git"
brew "bat"
brew "eza"
brew "jq"
brew "docker"
brew "ripgrep"
brew "curl"
brew "coursier"
brew "awscli"

# Mac App Storeのアプリケーションの管理
mas "RunCat", id: 1429033973
